tutorials/StagDrop/interStagDrop/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         9.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            probes;

interpolationScheme cellPoint;

libs            ("libsampling.so");

setFormat     raw;

fields
(
    p
);

probeLocations
(
    (0.0125 0.0125 0.0125)
    (0.00375 0.00375 0.00375)
	(0.00375 0.00375 0.02125)
	(0.00375 0.02125 0.00375)
	(0.00375 0.02125 0.02125)
	(0.02125 0.00375 0.00375)
	(0.02125 0.00375 0.02125)
	(0.02125 0.02125 0.00375)
	(0.02125 0.02125 0.02125)
);

// ************************************************************************* //
